Jester2/app/controllers/index_controller.rb

SELECT "jokes".* FROM "jokes"  ORDER BY "jokes"."created_at" ASC
SELECT "comments".* FROM "comments"  ORDER BY "comments"."created_at" ASC
---
  def index
    @jokes = Joke.all
    @comments = Comment.all