Jester2/app/controllers/jokes_controller.rb

SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT 1  [["id", 120]]
---
  def show
    @joke = Joke.find_by(id: params[:id])

SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT 1  [["id", 101]]
---
  def edit
    @joke = Joke.find_by(id: params[:id])

INSERT INTO "jokes" ("line1", "line2", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["line1", "sdfsdf"], ["line2", "sdfdfsdfsds"], ["user_id", 1], ["created_at", "2015-04-06 20:07:09.853821"], ["updated_at", "2015-04-06 20:07:09.853821"]]
---
  def create
    # TODO: Fix new joke
    new_joke = Joke.new(joke_params)
    if new_joke.save!

DELETE FROM "jokes" WHERE "jokes"."id" = $1  [["id", 123]]
SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT 1  [["id", 123]]
---
  def destroy
    Joke.find(params[:id]).destroy