Jester2/app/controllers/sessions_controller.rb

  def create
    user = User.find_by_name(params[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "bcheng90"]]