Jester2/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "benben"], ["password_digest", "$2a$10$8TcT0Y/Gjl6vCXQm18uGHuSw4xLqbxxbqRlitGPJd7hBKIvnhUKEy"], ["created_at", "2015-04-06 15:39:20.948337"], ["updated_at", "2015-04-06 15:39:20.948337"]]
---
  def create
    user = User.new(user_params)
    if user.save