Jester2/app/views/partials/_user_jokes.erb

SELECT "jokes".* FROM "jokes" WHERE "jokes"."user_id" = $1  ORDER BY "jokes"."created_at" ASC  [["user_id", 1]]
---
<ul>
  <% @user.jokes.order(:created_at).reverse.each do |joke| %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."joke_id" = $1  [["joke_id", 101]]
---
      <a href="/jokes/<%= joke.id %>"><%=joke.line1%></a><br>
      <span class="small"><a href="/jokes/<%= joke.id %>"><%=time(joke)%> days ago</a> | <a href="/joke/<%= joke.id %>"><%=joke.comments.count%> comments</a>