Jester2/app/views/partials/_user_comments.erb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  ORDER BY "comments"."created_at" ASC  [["user_id", 1]]
---
<ul>
  <% @user.comments.order(:created_at).reverse.each do |comment|%>