Jester2/app/views/jokes/show.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."joke_id" = $1  [["joke_id", 120]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."joke_id" = $1  [["joke_id", 120]]
---
  <span class="small">
    <a href="/jokes/<%= @joke.id %>"><%=@joke.comments.count%> comments</a> and <%= rand(1..10)%> laughes for <a href="/users/<%=@joke.user.id%>"><%=@joke.user.name%></a> | <a href="/jokes/<%= @joke.id %>"><%=time(@joke)%> moons ago</a>